In [2]:
import pandas as pd
import numpy as np

In [3]:
df = pd .read_csv('https://raw.githubusercontent.com/ardhiraka/PFDS_sources/master/property_data.csv')

In [5]:
df.describe()
#default argumen untuk parameter “include” = int, float

                PID      ST_NUM
count  8.000000e+00    7.000000
mean   1.000050e+08  191.428571
std    2.927700e+03   39.080503
min    1.000010e+08  104.000000
25%    1.000028e+08  199.000000
50%    1.000050e+08  203.000000
75%    1.000072e+08  210.000000
max    1.000090e+08  215.000000

In [6]:
df.describe(include="object")

         ST_NAME OWN_OCCUPIED NUM_BEDROOMS NUM_BATH SQ_FT
count          9            8            7        8     8
unique         5            3            5        4     8
top     BERKELEY            Y            3        1   800
freq           3            5            3        4     1

In [7]:
df.describe(include=["int", "object"])

         ST_NAME OWN_OCCUPIED NUM_BEDROOMS NUM_BATH SQ_FT
count          9            8            7        8     8
unique         5            3            5        4     8
top     BERKELEY            Y            3        1   800
freq           3            5            3        4     1

In [9]:
df

           PID  ST_NUM     ST_NAME OWN_OCCUPIED NUM_BEDROOMS NUM_BATH SQ_FT
0  100001000.0   104.0      PUTNAM            Y            3        1  1000
1  100002000.0   197.0   LEXINGTON            N            3      1.5    --
2  100003000.0     NaN   LEXINGTON            N          NaN        1   850
3  100004000.0   201.0    BERKELEY           12            1      NaN   700
4          NaN   203.0    BERKELEY            Y            3        2  1600
5  100006000.0   207.0    BERKELEY            Y          NaN        1   800
6  100007000.0     NaN  WASHINGTON          NaN            2   HURLEY   950
7  100008000.0   213.0     TREMONT            Y           --        1   NaN
8  100009000.0   215.0     TREMONT            Y           na        2  1800

In [13]:
from datetime import datetime

In [17]:
date_rng = pd.date_range(start='1/01/2020', end='1/08/2020',freq='H')

In [15]:
date_rng

DatetimeIndex(['2020-01-01 00:00:00', '2020-01-01 01:00:00',
               '2020-01-01 02:00:00', '2020-01-01 03:00:00',
               '2020-01-01 04:00:00', '2020-01-01 05:00:00',
               '2020-01-01 06:00:00', '2020-01-01 07:00:00',
               '2020-01-01 08:00:00', '2020-01-01 09:00:00',
               ...
               '2020-01-07 15:00:00', '2020-01-07 16:00:00',
               '2020-01-07 17:00:00', '2020-01-07 18:00:00',
               '2020-01-07 19:00:00', '2020-01-07 20:00:00',
               '2020-01-07 21:00:00', '2020-01-07 22:00:00',
               '2020-01-07 23:00:00', '2020-01-08 00:00:00'],
              dtype='datetime64[ns]', length=169, freq='H')

In [18]:
df = pd.DataFrame(date_rng,columns=['date'])

In [23]:
df['data'] = np.random.randint(0,100,size=len(date_rng))

In [24]:
df.head

<bound method NDFrame.head of                    date  data
0   2020-01-01 00:00:00    52
1   2020-01-01 01:00:00    89
2   2020-01-01 02:00:00    71
3   2020-01-01 03:00:00     8
4   2020-01-01 04:00:00    94
..                  ...   ...
164 2020-01-07 20:00:00    59
165 2020-01-07 21:00:00    17
166 2020-01-07 22:00:00    62
167 2020-01-07 23:00:00    61
168 2020-01-08 00:00:00    82

[169 rows x 2 columns]>